const Weather_Array = [
    {
      "Город": "Абакан",
      "Температура, °C": -17,
      "Влажность, %": 98,
      "Атмосферное давление": 754,
      "Осадки": 1
    },
    {
      "Город": "Адлер",
      "Температура, °C": 19,
      "Влажность, %": 79,
      "Атмосферное давление": 757,
      "Осадки": 3
    },
    {
      "Город": "Алчевск",
      "Температура, °C": 7,
      "Влажность, %": 76,
      "Атмосферное давление": 742,
      "Осадки": 2
    },
    {
      "Город": "Анапа",
      "Температура, °C": 16,
      "Влажность, %": 82,
      "Атмосферное давление": 755,
      "Осадки": 4
    },
    {
      "Город": "Антрацит",
      "Температура, °C": 7,
      "Влажность, %": 70,
      "Атмосферное давление": 740,
      "Осадки": 3
    },
    {
      "Город": "Артемовск",
      "Температура, °C": 7,
      "Влажность, %": 77,
      "Атмосферное давление": 751,
      "Осадки": 3
    },
    {
      "Город": "Архангельск",
      "Температура, °C": -6,
      "Влажность, %": 93,
      "Атмосферное давление": 752,
      "Осадки": 2
    },
    {
      "Город": "Астрахань",
      "Температура, °C": 13,
      "Влажность, %": 88,
      "Атмосферное давление": 763,
      "Осадки": 3
    },
    {
      "Город": "Барнаул",
      "Температура, °C": -10,
      "Влажность, %": 94,
      "Атмосферное давление": 757,
      "Осадки": 2
    },
    {
      "Город": "Белгород",
      "Температура, °C": 5,
      "Влажность, %": 89,
      "Атмосферное давление": 742,
      "Осадки": 1
    },
    {
      "Город": "Бердянск",
      "Температура, °C": 12,
      "Влажность, %": 75,
      "Атмосферное давление": 760,
      "Осадки": 6
    },
    {
      "Город": "Бийск",
      "Температура, °C": -11,
      "Влажность, %": 89,
      "Атмосферное давление": 757,
      "Осадки": 3
    },
    {
      "Город": "Благовещенск",
      "Температура, °C": -18,
      "Влажность, %": 89,
      "Атмосферное давление": 758,
      "Осадки": 1
    },
    {
      "Город": "Братск",
      "Температура, °C": -16,
      "Влажность, %": 85,
      "Атмосферное давление": 729,
      "Осадки": 1
    },
    {
      "Город": "Брянск",
      "Температура, °C": 2,
      "Влажность, %": 94,
      "Атмосферное давление": 742,
      "Осадки": 2
    },
    {
      "Город": "Великий Новгород",
      "Температура, °C": 2,
      "Влажность, %": 91,
      "Атмосферное давление": 756,
      "Осадки": 1
    },
    {
      "Город": "Владивосток",
      "Температура, °C": 0,
      "Влажность, %": 54,
      "Атмосферное давление": 753,
      "Осадки": 9
    },
    {
      "Город": "Владикавказ",
      "Температура, °C": 11,
      "Влажность, %": 68,
      "Атмосферное давление": 700,
      "Осадки": 1
    },
    {
      "Город": "Владимир",
      "Температура, °C": 1,
      "Влажность, %": 90,
      "Атмосферное давление": 744,
      "Осадки": 3
    },
    {
      "Город": "Волгоград",
      "Температура, °C": 8,
      "Влажность, %": 77,
      "Атмосферное давление": 750,
      "Осадки": 3
    },
    {
      "Город": "Волгодонск",
      "Температура, °C": 10,
      "Влажность, %": 72,
      "Атмосферное давление": 756,
      "Осадки": 3
    },
    {
      "Город": "Волжский",
      "Температура, °C": 9,
      "Влажность, %": 77,
      "Атмосферное давление": 761,
      "Осадки": 3
    },
    {
      "Город": "Волноваха",
      "Температура, °C": 8,
      "Влажность, %": 71,
      "Атмосферное давление": 737,
      "Осадки": 4
    },
    {
      "Город": "Вологда",
      "Температура, °C": 0,
      "Влажность, %": 85,
      "Атмосферное давление": 744,
      "Осадки": 4
    },
    {
      "Город": "Воронеж",
      "Температура, °C": 3,
      "Влажность, %": 86,
      "Атмосферное давление": 749,
      "Осадки": 2
    },
    {
      "Город": "Геленджик",
      "Температура, °C": 17,
      "Влажность, %": 81,
      "Атмосферное давление": 755,
      "Осадки": 6
    },
    {
      "Город": "Геническ",
      "Температура, °C": 12,
      "Влажность, %": 80,
      "Атмосферное давление": 758,
      "Осадки": 6
    },
    {
      "Город": "Горловка",
      "Температура, °C": 7,
      "Влажность, %": 72,
      "Атмосферное давление": 742,
      "Осадки": 3
    },
    {
      "Город": "Димитров",
      "Температура, °C": 7,
      "Влажность, %": 73,
      "Атмосферное давление": 745,
      "Осадки": 3
    },
    {
      "Город": "Доброполье",
      "Температура, °C": 7,
      "Влажность, %": 77,
      "Атмосферное давление": 744,
      "Осадки": 3
    },
    {
      "Город": "Донецк",
      "Температура, °C": 8,
      "Влажность, %": 66,
      "Атмосферное давление": 742,
      "Осадки": 3
    },
    {
      "Город": "Дружковка",
      "Температура, °C": 7,
      "Влажность, %": 78,
      "Атмосферное давление": 751,
      "Осадки": 3
    },
    {
      "Город": "Екатеринбург",
      "Температура, °C": 2,
      "Влажность, %": 99,
      "Атмосферное давление": 734,
      "Осадки": 4
    },
    {
      "Город": "Енакиево",
      "Температура, °C": 8,
      "Влажность, %": 70,
      "Атмосферное давление": 745,
      "Осадки": 3
    },
    {
      "Город": "Железный Порт",
      "Температура, °C": 12,
      "Влажность, %": 84,
      "Атмосферное давление": 759,
      "Осадки": 7
    },
    {
      "Город": "Запорожье",
      "Температура, °C": 8,
      "Влажность, %": 73,
      "Атмосферное давление": 751,
      "Осадки": 4
    },
    {
      "Город": "Златоуст",
      "Температура, °C": 2,
      "Влажность, %": 81,
      "Атмосферное давление": 712,
      "Осадки": 3
    },
    {
      "Город": "Иваново",
      "Температура, °C": 1,
      "Влажность, %": 89,
      "Атмосферное давление": 747,
      "Осадки": 4
    },
    {
      "Город": "Ижевск",
      "Температура, °C": 7,
      "Влажность, %": 86,
      "Атмосферное давление": 739,
      "Осадки": 6
    },
    {
      "Город": "Иркутск",
      "Температура, °C": -6,
      "Влажность, %": 90,
      "Атмосферное давление": 727,
      "Осадки": 5
    },
    {
      "Город": "Йошкар-Ола",
      "Температура, °C": 6,
      "Влажность, %": 87,
      "Атмосферное давление": 743,
      "Осадки": 6
    },
    {
      "Город": "Казань",
      "Температура, °C": 8,
      "Влажность, %": 87,
      "Атмосферное давление": 742,
      "Осадки": 7
    },
    {
      "Город": "Калининград",
      "Температура, °C": 11,
      "Влажность, %": 68,
      "Атмосферное давление": 743,
      "Осадки": 9
    },
    {
      "Город": "Калуга",
      "Температура, °C": 1,
      "Влажность, %": 94,
      "Атмосферное давление": 743,
      "Осадки": 2
    },
    {
      "Город": "Каховка",
      "Температура, °C": 10,
      "Влажность, %": 72,
      "Атмосферное давление": 757,
      "Осадки": 3
    },
    {
      "Город": "Кемерово",
      "Температура, °C": -12,
      "Влажность, %": 91,
      "Атмосферное давление": 750,
      "Осадки": 3
    },
    {
      "Город": "Кирилловка",
      "Температура, °C": 11,
      "Влажность, %": 75,
      "Атмосферное давление": 740,
      "Осадки": 5
    },
    {
      "Город": "Киров",
      "Температура, °C": 4,
      "Влажность, %": 95,
      "Атмосферное давление": 735,
      "Осадки": 6
    },
    {
      "Город": "Комсомольск-на-Амуре",
      "Температура, °C": -11,
      "Влажность, %": 87,
      "Атмосферное давление": 762,
      "Осадки": 3
    },
    {
      "Город": "Константиновка",
      "Температура, °C": 8,
      "Влажность, %": 78,
      "Атмосферное давление": 754,
      "Осадки": 3
    },
    {
      "Город": "Кострома",
      "Температура, °C": 1,
      "Влажность, %": 84,
      "Атмосферное давление": 746,
      "Осадки": 4
    },
    {
      "Город": "Краматорск",
      "Температура, °C": 6,
      "Влажность, %": 82,
      "Атмосферное давление": 741,
      "Осадки": 2
    },
    {
      "Город": "Красноармейск",
      "Температура, °C": 7,
      "Влажность, %": 73,
      "Атмосферное давление": 744,
      "Осадки": 3
    },
    {
      "Город": "Краснодар",
      "Температура, °C": 15,
      "Влажность, %": 78,
      "Атмосферное давление": 756,
      "Осадки": 3
    },
    {
      "Город": "Краснодон",
      "Температура, °C": 7,
      "Влажность, %": 75,
      "Атмосферное давление": 749,
      "Осадки": 2
    },
    {
      "Город": "Красноярск",
      "Температура, °C": -11,
      "Влажность, %": 95,
      "Атмосферное давление": 751,
      "Осадки": 2
    },
    {
      "Город": "Красный Луч",
      "Температура, °C": 7,
      "Влажность, %": 70,
      "Атмосферное давление": 739,
      "Осадки": 3
    },
    {
      "Город": "Курган",
      "Температура, °C": 0,
      "Влажность, %": 90,
      "Атмосферное давление": 760,
      "Осадки": 6
    },
    {
      "Город": "Курск",
      "Температура, °C": 3,
      "Влажность, %": 91,
      "Атмосферное давление": 740,
      "Осадки": 1
    },
    {
      "Город": "Липецк",
      "Температура, °C": 3,
      "Влажность, %": 92,
      "Атмосферное давление": 746,
      "Осадки": 2
    },
    {
      "Город": "Лисичанск",
      "Температура, °C": 8,
      "Влажность, %": 85,
      "Атмосферное давление": 757,
      "Осадки": 2
    },
    {
      "Город": "Луганск",
      "Температура, °C": 8,
      "Влажность, %": 80,
      "Атмосферное давление": 757,
      "Осадки": 2
    },
    {
      "Город": "Магнитогорск",
      "Температура, °C": 5,
      "Влажность, %": 76,
      "Атмосферное давление": 729,
      "Осадки": 6
    },
    {
      "Город": "Майкоп",
      "Температура, °C": 15,
      "Влажность, %": 83,
      "Атмосферное давление": 739,
      "Осадки": 1
    },
    {
      "Город": "Макеевка",
      "Температура, °C": 9,
      "Влажность, %": 63,
      "Атмосферное давление": 744,
      "Осадки": 3
    },
    {
      "Город": "Мариуполь",
      "Температура, °C": 11,
      "Влажность, %": 74,
      "Атмосферное давление": 754,
      "Осадки": 6
    },
    {
      "Город": "Махачкала",
      "Температура, °C": 16,
      "Влажность, %": 63,
      "Атмосферное давление": 763,
      "Осадки": 1
    },
  ];
// устанавливаем соответствие между полями формы и столбцами таблицы
let correspond = {
    "Город": "cityLetter",
    "Температура, °C": ["TempFrom", "TempTo"],
    "Влажность, %": ["HumFrom","HumTo"],
    "Атмосферное давление": ["PresFrom","PressTo"],
    "Осадки": "precipitation"
};